In [4]:
a = ['sam m', 'sam n', 'dsdsf', 'ddewddw', 'wdfw']

sams = [member for member in a if ('sam' in member)]

In [9]:
id(a[0])

140121507398576

In [10]:
id(sams[0])

140121507398576

In [11]:
my_list = [1, 2, 3]
new_list = []

for number in my_list:
    new_list.append(number)
    print(my_list)

print(f"My list: {my_list}")
print(f"New list: {new_list}")

[1, 2, 3]
[1, 2, 3]
[1, 2, 3]
My list: [1, 2, 3]
New list: [1, 2, 3]

In [1]:
import pandas as pd
#write your code here
dc = {'Student' : ['David', 'Samuel', 'Terry', 'Evan'], 
        'Age' : [27, 24, 22, 32],
        'Country' : ['UK', 'Canada', 'China', 'USA'],
        'Course' : ['Python', 'Data Structures', 'Machine Learning', 'Web Development'],
        'Marks' : [85, 72, 89, 76]}
df = pd.DataFrame(dc)
df

  Student  Age Country            Course  Marks
0   David   27      UK            Python     85
1  Samuel   24  Canada   Data Structures     72
2   Terry   22   China  Machine Learning     89
3    Evan   32     USA   Web Development     76

In [5]:
b = df['Country']
b

0        UK
1    Canada
2     China
3       USA
Name: Country, dtype: object

In [6]:
df

  Student  Age Country            Course  Marks
0   David   27      UK            Python     85
1  Samuel   24  Canada   Data Structures     72
2   Terry   22   China  Machine Learning     89
3    Evan   32     USA   Web Development     76

In [7]:
df.loc[0:2, 'Age':'Course']

   Age Country            Course
0   27      UK            Python
1   24  Canada   Data Structures
2   22   China  Machine Learning